%%%-------------------------------------------------------------------
%%% @author ${Eric}
%%% @copyright (C) 2018, ${suyou_game}
%%% @doc
%%%%
%%% (3).编写一个环形计时测试。创建一个由N个进程组成的环。
% 把一个消息沿着环发送M次，这样总共发送的消息是M*N。
% 记录不同的N和M值所花费的时间
% 用你熟悉的其他编程语言编写一个类似的程序，然后比较一下结果。
% 写一篇博客，把结果在网上发表出来。
%%% @end
%%% Created : 13. 三月 2018 15:48
%%%-------------------------------------------------------------------
-module(looptimingtest).
-author("Eric").

%% API
-compile(export_all).

start(N,M) ->sendmsg(creatprocess(N),).

%创建N个进程

creatprocess(N) ->
	for(),




























